[
    {
        "text": "Tune in to the Alternate Current Radio Network (ACR) for another LIVE broadcast of  The Boiler Room  starting at 6 PM PST | 9 PM EST every Wednesday. Join us for uncensored, uninterruptible talk radio, custom-made for barfly philosophers, misguided moralists, masochists, street corner evangelists, media-maniacs, savants, political animals and otherwise lovable rascals.Join ACR hosts Hesher, & Spore along with Andy Nowicki from Alt Right Blogspot, 21Wire mastermind Patrick Henningsen and Stewart Howe. In this broadcast we re going big time with an extra long overdrive episode, listeners will be hearing us go around the BOILER ROOM on a plethora of topics tonight including  cuddle parties,  a Saudi millionaire running free on rape allegations after claiming to have tripped and fell on victim, Hesher bashes Guns  N Roses, the life span of the iPod about to be ended by a resurgence in tape cassette technology, permaculture farming, federal land grabs, and the demonization of the militia. We give a detailed breakdown of the situation unfolding in Oregon with regards to the Ammon Bundy s (and others) arrest and the execution style ambush and murder of Robert Lavoy Finicum. If you want to participate, bring something interesting to throw into the boiler Join us in the ALTERNATE CURRENT RADIO chat room.BOILER ROOM IS NOT A POLICTALLY CORRECT ZONE!   Live ACR player below   Show goes live at 6 PM PST This week s topics: ",
        "label": 0
    },
    {
        "text": "WASHINGTON (Reuters) - Cyber security experts and U.S. officials said on Monday there was evidence that Russia engineered the release of sensitive Democratic Party emails in order to influence the U.S. presidential election. The FBI said it was investigating a cyber intrusion at the Democratic National Committee (DNC), which has led to discord as  the party’s convention in Philadelphia opens on Monday to nominate former U.S. secretary of state Hillary Clinton as its candidate. Although the hacking of the DNC was known to officials and cyber security experts a month ago, the timing of the release of the contents of communications within the party is what is causing concern for U.S. authorities. A U.S. official involved in the investigation said that the classified information collected on the hack so far “indicated beyond a reasonable doubt that it originated in Russia.”  The official, speaking on condition of anonymity, said that the timing of the release of emails “has all the hallmarks of a classic intelligence operation intended to damage a perceived adversary.” The official said, however, that it may be impossible to prove definitively that Russian President Vladimir Putin’s government directed the attack. The emails, released by activist group WikiLeaks at the weekend, appeared to show favoritism within the DNC for Clinton over U.S. Senator Bernie Sanders of Vermont, who ran a close race for the nomination for the Nov. 8 election. The committee is supposed to be neutral and the disclosure forced chairwoman Debbie Wasserman Schultz, a congresswoman from Florida, to resign. The U.S. House of Representatives intelligence committee has been briefed and will seek information on any potential connection to Russia or any other state, said Representative Adam Schiff, the senior Democrat on the panel. “That foreign actors may be trying to influence our election - let alone a powerful adversary like Russia - should concern all Americans of any party.” Schiff said in a statement. On Sunday, Clinton campaign manager Robby Mook told CNN that the campaign had been told by “experts” that the emails were released by suspected Russian hackers to help Republican Party nominee Donald Trump. The businessman’s campaign dismissed the allegation as absurd. Trump has often praised Putin, calling him a “strong leader.” Trump is a critic of NATO and last week he  told The New York Times that he might not back countries in the alliance if they were attacked by Russia, unless he was sure they had made sufficient contributions to the group.  Russia has long been considered among the most elite U.S. adversaries in cyberspace, though its actions are generally viewed as efforts at covert intelligence gathering. “Usually, the Russians are not ham-handed,” said Jim Lewis, a cyber security expert at the Center for Strategic and International Studies in Washington. He said Russia was believed to have hacked Democratic and Republican campaigns in 2008, but that it did not leak material. “It would be a bold move to try and shape the election, but we can’t rule it out,” Lewis said. CrowdStrike, a cyber firm that helped clean up the breach, said last month it had identified two hacking groups that infiltrated the DNC and that both were believed to be working on behalf of two competing arms of the Russian government. Its findings were later supported by similar conclusions reached by FireEye’s (FEYE.O) Mandiant unit and Fidelis, two other U.S.-based cyber companies.   Experts said that forensic analysis of the breach also links the same hackers to attacks at the White House, the State Department, the German Bundestag and private companies. The Federal Bureau of Investigation declined to say when its probe of the hack began. “A compromise of this nature is something we take very seriously, and the FBI will continue to investigate and hold accountable those who pose a threat in cyberspace,” it said in a statement. WikiLeaks released more than 19,000 DNC emails on Saturday. On Twitter it rejected as speculation claims made that Russia was the source of the cache. The group also said that there would be more leaks related to the U.S. election. White House spokesman Josh Earnest said he could not speak to the veracity of private sector conclusions pointing to Russia as the culprit in the DNC hack, but that he was confident the FBI would thoroughly investigate the matter. ",
        "label": 1
    },
    {
        "text": "MANILA (Reuters) - Philippine President Rodrigo Duterte on Monday asked Congress to extend martial law on the southern island of Mindanao for a year, arguing that Islamist militants have been regrouping since a five-month urban conflict ended there in October. He said fighters who survived the battle for Marawi City were determined to establish a Southeast Asian  wilayat    or governorate - for Islamic State and named militant Abu Turaifie as potentially the radical group s next regional  emir . The previous  emir , Isnilon Hapilon, and another rebel commander loyal to Islamic State were killed in October as the military closed in on fighters who had occupied the heart of Marawi since May 23. More than 1,100 people - mostly militants - were killed and 350,000 displaced by the Marawi unrest. In his letter to the Senate and House of Representatives, Duterte said militants were radicalizing and recruiting local people, reorganizing themselves and building their finances.  These activities are geared towards the conduct of intensified atrocities and armed public uprisings,  he said, adding that they were aimed at establishing a global Islamic caliphate and a  wilayat , not only in the Philippines but the whole of Southeast Asia.  A group led by Turaifie - who heads a splinter group of the Bangsamoro Islamic Freedom Fighters and, according to Duterte, is  said to be Hapilon s potential successor  - was planning bombings in the Cotabato province south of Marawi. Intelligence reports indicate that militants are plotting to attack another city, Presidential Communications Secretary Martin Andanar said on Monday. Duterte placed restive Mindanao, which has a population of 22 million, under military rule after the attack on Marawi, and martial law was due to be lifted there on Dec. 31.  Lawmakers will vote on his request for a one-year extension at a joint session on Wednesday, Congress majority leader Rodolfo Farinas told reporters. Continuing martial law beyond the initial 60-day limit requires lawmakers  approval, but the constitution does not limit any extensions. Martial law allows for tougher surveillance and arrests without warrant, giving security forces greater rein to go after suspected extremist financiers and facilitators. Duterte has long warned that Mindanao faced contamination by Islamic State, and experts say Muslim parts of the predominantly Catholic southern Philippines are fertile ground for expansion, due to their history of marginalization and neglect. Critics of Duterte, who has held open the possibility of extending military rule to the whole country, have slammed the imposition of martial law in Mindanao as a misuse of power and evidence of the president s authoritarian tendencies. Martial law is a sensitive issue in the Philippines, bringing back memories of the 1970s rule of late dictator Ferdinand Marcos, who was accused of exaggerating security threats to justify harsh measures to suppress dissent. Human rights group Karapatan questioned why martial law should be extended in Mindanao nearly two months after the military s victory in Marawi City.  This is a dangerous precedent that inches the entire country closer to a nationwide declaration of martial rule,  it said in a statement.      ",
        "label": 1
    },
    {
        "text": "WASHINGTON (Reuters) - A small group of bipartisan senators introduced a bill Thursday that would block a pending judicial rule change allowing U.S. judges to issue search warrants for remote access to computers in any jurisdiction, even overseas, arguing the change would expand the FBI’s hacking authority. The one-page legislation from Democratic Senator Ron Wyden and Republican Senator Rand Paul would undo the change, adopted by the U.S. Supreme Court in a private vote last month and without congressional involvement, to procedural rules governing the court system. Republican Senator Steve Daines and Democrats Tammy Baldwin and Jon Tester are co-sponsoring the Stopping Mass Hacking Act. Magistrate judges currently can only order searches within the jurisdiction of their court, typically limited to a few counties. “This is a dramatic expansion of the government’s hacking and surveillance authority,” Wyden said in a statement. “Such a substantive change with an enormous impact on Americans’ constitutional rights should be debated by Congress, not maneuvered through an obscure bureaucratic process.” Companion legislation is expected in the House soon,  Wyden’s office said. The U.S. Justice Department has pushed for the rule change since 2013 and has portrayed it as a procedural tweak needed to modernize the criminal code to pursue sophisticated 21st century criminals. Congress has until Dec. 1 to vote to reject, amend or postpone the changes to Rule 41 of the federal rules of criminal procedure. If lawmakers fail to act, the change will automatically take effect, a scenario seen as likely given the short timeline.  But civil liberties groups and Alphabet’s Google  have argued the change should be properly authorized by Congress  and could violate the U.S. Constitution’s protections against unreasonable searches and seizures.  Many organizations have vowed to lobby Congress intensely in the coming months to block it. The change would permit judges to issue warrants in cases where a suspect uses anonymizing technology to conceal the location of his or her computer or for an investigation into a network of hacked or infected computers, such as a botnot. Tensions over the FBI’s secretive hacking tools, also known as “network investigative techniques,” have played out in a number of recent cases involving the bureau’s covert seizure of a dark web child pornography website in February 2015 to track thousands of the site’s visitors. Two defendants in the investigation secured rulings last month declaring the warrants used in their cases were invalid under current limitations of Rule 41. ",
        "label": 1
    },
    {
        "text": "BANGKOK (Reuters) - A Thai criminal court on Monday said it would proceed to determine whether it would hear a case in a 14 billion baht ($423 million) lawsuit brought against Thai duty-free giant King Power International, the company that owns English Premier League football club Leicester City. The Central Criminal Court for Corruption and Misconduct Cases in Bangkok said it would look into the allegations made in the lawsuit to determine whether there was a case to be heard, and would review the list of potential evidence and witnesses in February ahead of preliminary hearings.     Charnchai Issarasenanark, at the time an anti-graft official, filed the suit in a private capacity in July against the duty-free retailer, which is owned by billionaire Vichai Srivaddhanaprabha and his family. The committee of which Charnchai was a member has since become defunct as part of the military government s plan to restore democracy.    The suit accuses King Power of criminally failing to pay the Thai government 14 billion baht from the operation of the airport franchise it was granted in 2006.    The suit was also brought against executives from the state-owned airport operator, Airports of Thailand (AOT). In a statement on Monday, King Power said:  The allegations in question have yet to be accepted by the court and are categorically denied. King Power has always followed and been absolutely committed to the highest standards in proper and ethical business practice. We are proud of our company s good name and honest reputation and will fight rigorously any attempts to discredit them.  The AOT was not immediately available for comment. Self-made businessman Vichai founded King Power in 1989. The duty-free business took off in 2006 when it was granted an airport monopoly under the government of then prime minister Thaksin Shinawatra, but it continued to prosper even after Thaksin s ouster in a coup that year. Vichai bought Leicester City in August 2010. The family s empire also includes Belgian football club, Oud-Heverlee Leuven, Accor s Pullman hotels in Thailand and a controlling stake in Asia Aviation Pcl, operator of low-cost carrier Thai AirAsia. ",
        "label": 1
    },
    {
        "text": "NEW YORK/WASHINGTON (Reuters) - U.S. health insurers are making their case to Republican lawmakers over how Americans sign up for individual insurance and pushing for other changes to shape the replacement of former President Barack Obama’s national healthcare law.  The health insurers, including Independence Blue Cross and Molina Healthcare Inc, are also recommending ways to put more control over insurance in the hands of states as the federal oversight of Obamacare is dismantled. They emphasize that it is crucial to keep government subsidies for low income people. These changes, described by executives, high level officials in the health insurance sector and lawmakers in nearly a dozen interviews with Reuters, include pushing for more strict enforcement of eligibility for these plans.  Because Republicans are just starting to work with the new Trump administration and the debate is fluid, it is not clear ultimately what changes will take hold. But some of these ideas have started to surface in early Republican legislation, such as a co-sponsored bill from Maine Senator Susan Collins that would keep subsidies.  The moves underscore that private insurers are quietly working on how to benefit under the Trump administration, which is focusing on deregulation in healthcare, energy and manufacturing. And they show that insurers want to save aspects of Obamacare individual plans, but cut down on the risk to their own bottom lines and any hikes in premiums that threaten the viability of this insurance market. This market for individual insurance covers about 10 million people and is small compared to the employer-based system that covers more than 160 million Americans and the government-paid programs for over 120 million people.  But it is one that insurers have described as having growth potential. While Obamacare cut the uninsured rate to 11 percent, there are still millions of uninsured Americans. The largest U.S. insurer UnitedHealth Group Inc told investors recently that it sees opportunities in new state-based markets and is talking to policymakers.  Many investors believe that the Republican deregulation push with Trump will benefit insurers. “Clearly they support the private insurers and the role that they are going to play in any sort of new market,” said Jeff Jonas, a portfolio manager at Gamco Investors in Rye, New York, which he said owns the publicly traded insurers. President Donald Trump campaigned on a promise to repeal Obama’s national healthcare law on his first day in office. He and Republicans have not presented an agreed upon replacement plan, but key issues they are expected to address include the law’s requirements for individuals to have insurance. Insurers’ main “ask” takes into account replacement plans under discussion in Congress, and largely assumes that government funds will continue to subsidize health benefits, at least for the next two to three years.  Daniel Hilferty, CEO of Independence Blue Cross in Pennsylvania, told Reuters that he advocated tightening the rules around signing up for insurance outside of the open enrollment period, and tight control of which third parties are allowed to pay premiums for patients.  Independence is part of a nationwide network of Blue Cross Blue Shield licensees such as Anthem Inc and has enrolled more than 300,000 consumers in individual plans.  Hilferty’s requests, echoed by other people in the industry who did not want to be named, are similar to demands the industry made of Obama. Enrollment outside of the regular period - and third-party groups that keep poorer, sicker patients in the private market by paying their premiums - has helped lead to hundreds of millions of dollars in losses for insurers and pushed three of the nation’s largest players out of the Obamacare market. In addition, Independence is also asking for a bigger role in signing up new customers who want to buy individual plans. Insurers sell plans both on the exchanges and off the exchanges, but subsidized plans are currently mostly sold on the government run HealthCare.gov and on state-run websites in a dozen states. “It would be really helpful if we in the industry played a more significant role in the actual enrollment process,” Hilferty said. Trump signed an executive order on Friday directing the federal government to scale back regulations, taxes and penalties related to the law. But the directive did not change the priorities outlined to Reuters by the insurers and industry sources, they said.   Insurers have built their list of top priorities assuming in part that Republicans will try to overturn the existing individual mandate, which requires Americans to pay a fee if they do not have insurance. A replacement plan would need to include some type of bonus to entice healthy people to get insurance.  That, they say, would be a step towards a good mix of sick and healthy people that will keep the plans profitable. Ideas include creating high-risk pools to keep the very sick in a separate market and offering low prices to the young and healthy.     Without a punishment for not buying insurance that is like the individual mandate, the market can’t survive, according to Dr. J. Mario Molina, Chief Executive Officer of Molina Healthcare Inc, a company that provides Medicaid for the poor and individual insurance plans on the exchanges.  “It probably needs to be a combination of both an incentive and a penalty,” Molina said.  Insurers also want to keep the cost-sharing subsidies that have made healthcare costs affordable for millions of people as well as the premium subsidies that help to reduce the monthly cost for people with low incomes. Those subsidies are part of a court case filed last year that is on hold.  “If it’s free or close to free, you are more likely to sign up in the absence of the mandate,” said Dan Mendelson, CEO of  Avalere Health, a research group and consultant that advises health insurers and is part of Inovalon Holdings. Insurers also want continued premium subsidies, skewed to keep up enrollment of younger people.  “I think if you don’t have the subsidies, then the whole thing falls apart,” said  Molina. ",
        "label": 1
    },
    {
        "text": "(Reuters) - U.S. Senate Republicans were expected to vote on Tuesday for opening debate on a healthcare bill without knowing what is in it, but the potential components of the legislation were clear.  Approaches hammered out by Republicans in recent months were expected to be in the mix, with Senate Majority Leader Mitch McConnell making key choices about what is in and what is out, based on how much support a given combination can attract. One bill he could introduce would repeal much of Obamacare with no replacement plan. Another bill could repeal and replace the 2010 law while also overhauling Medicaid, the federal health insurance program for the poor and disabled. Both bills have faced criticism from the health industry.  The Affordable Care Act, dubbed Obamacare, extended insurance to 20 million Americans and was Democratic former President Barack Obama’s signature domestic achievement. For seven years, Republicans have promised to repeal and replace it, but have struggled to do so, even though they now control both chambers of Congress and the White House. Another path open to McConnell would be to develop an entirely new bill on the Senate floor through amendments. Here are summaries of bills that could be in play: A shortened version of Obamacare repeal, called a “skinny repeal,” could end Obamacare’s individual and employer mandates and the medical device tax, said a Senate aide and a lobbyist. Senate Republicans would likely go for a bare-minimum “skinny repeal” only if other approaches, such as those below, cannot win approval. McConnell has said he could introduce a bill that Republicans passed in 2015 that was subsequently vetoed by Obama, called the Obamacare Repeal Reconciliation Act. It would repeal most Obamacare taxes and end funding for Obamacare’s Medicaid expansion, as well as tax credits that help low-income people buy health insurance on the individual insurance market. It would abolish a penalty on individuals who do not purchase insurance, as well as a penalty on certain employers who do not provide employees insurance. But the legislation does not include a replacement plan. If signed into law, Congress would have two years to craft and pass a replacement. The nonpartisan Congressional Budget Office (CBO) estimated the law would increase the number of uninsured Americans by 17 million in 2018, and by 32 million in 2026. The Senate has spent months negotiating a bill, called the Better Care Reconciliation Act, that would repeal and replace much of Obamacare, while also drastically cutting Medicaid. The latest version would repeal many Obamacare taxes, but retain two taxes on the wealthy. It would unwind Obamacare’s Medicaid expansion over three years, then slash spending on Medicaid beginning in 2025, as well as overhaul the law’s tax credits. It would also eliminate penalties on individuals for not purchasing insurance and employers who do not provide it. The bill includes an amendment from Senator Ted Cruz that would let insurers sell bare-bones policies that fall short of broad benefits mandated under Obamacare, such as maternity and newborn care and prescription drugs. The CBO estimated the bill would result in 22 million more people losing their insurance by 2026 and, in a separate report, estimated that Medicaid would be cut by 35 percent come 2036.  HOUSE-PASSED LEGISLATION In May, the House of Representatives passed its own version of healthcare legislation, called the American Health Care Act.  It would repeal most Obamacare taxes, including taxes on the wealthy, replace the law’s income-based tax credits with flat age-based credits capped at upper-income levels and end funding for the Medicaid expansion beginning in 2020.  Like the Senate legislation, it would eliminate the penalty on individuals who do not purchase insurance and employers who do not provide it to employees. Controversially, the House bill would eliminate the Obamacare mandate that insurers charge sick and healthy people the same rates. The CBO found it would result in 23 million more uninsured Americans by 2026 and destabilize the individual insurance market in much of the country. ",
        "label": 1
    },
    {
        "text": "MOSCOW (Reuters) - A senior Russian lawmaker said on Tuesday it was clear that  U.S. President Donald Trump’s national security adviser, Michael Flynn, had been forced to resign in an effort to damage relations between Russia and the United States. Flynn resigned late on Monday after revelations he had discussed U.S. sanctions on Russia with the Russian ambassador to the United States before Trump took office and misled Vice President Mike Pence about the conversations. “It’s obvious that Flynn was forced to write the letter of resignation under a certain amount of pressure,” Leonid Slutsky, head of the lower house of parliament’s foreign affairs committee, was quoted as saying by the RIA news agency. “The target was Russia-U.S. relations, undermining confidence in the new U.S. administration. We’ll see how the situation develops further,” he said. ",
        "label": 1
    },
    {
        "text": "BERLIN (Reuters) - German Social Democratic Party (SPD) members voted overwhelmingly on Thursday to allow their party s leadership to enter talks with Chancellor Angela Merkel s conservatives on forming a government. The party congress s vote means leaders can discuss options including a renewed  grand coalition , an informal cooperation or a formal agreement to tolerate a conservative minority government by not voting down certain parliamentary motions. ",
        "label": 1
    },
    {
        "text": "WASHINGTON (Reuters) - U.S. President Barack Obama will have a bilateral meeting with Turkish President Tayyip Erdogan during the G20 summit in China next month and is likely to have at least an informal talk with Russia’s Vladimir Putin, the White House said on Monday.   Obama wants to talk with Erdogan about events in Turkey after July’s attempted coup, the military campaign against Islamic State, and how to promote stability in Syria, Deputy National Security Advisor Ben Rhodes told reporters.  The White House said it opposes Turkey’s push into areas in northern Syria controlled by the Syrian Democratic Forces, or SDF, an opposition group the Obama administration supports, as it stands to erode the united front against Islamic State.  The Obama-Erdogan meeting is scheduled for Sunday. It was not certain whether Obama would hold a formal meeting with the Russian president during the G20 summit of the world’s biggest economies, which runs Sept 4-5. But the two leaders often speak on the margins of such summits, Rhodes said.  “We usually try to find an opportunity for the two leaders to try to spend some time together, usually to focus on Syria and Ukraine,” Rhodes said. The United States is at odds with Russia over the eastern Ukraine conflict and Washington and Moscow have struggled to stop fighting in Syria’s civil war. Kremlin spokesman Dmitry Peskov said a meeting between Putin and Obama has not yet been coordinated, Russian RIA news agency reported. “We are ready,” RIA cited Peskov as saying. “But there is no final agreement yet.”  ",
        "label": 1
    },
    {
        "text": "Republicans are flocking away from the GOP s presidential candidate in droves. One group of Republicans just joined the ranks of those who cannot support Donald Trump. The Harvard Republican Club has decided that they cannot in good conscience support Trump s presidential bid.On Thursday, the Harvard Republican Club s editorial board published a press release that masterfully lays out the case as to why they cannot    and nor should anyone else   support Trump: In every presidential election since 1888, the members and Executive Board of the Harvard Republican Club have gathered to discuss, debate, and eventually endorse the standard-bearer of our party. But for the first time in 128 years, we, the oldest College Republicans chapter in the nation, will not be endorsing the Republican nominee.Donald Trump holds views that are antithetical to our values not only as Republicans, but as Americans. The rhetoric he espouses  from racist slander to misogynistic taunts  is not consistent with our conservative principles, and his repeated mocking of the disabled and belittling of the sacrifices made by prisoners of war, Gold Star families, and Purple Heart recipients is not only bad politics, but absurdly cruel. According to the Harvard Crimson, very few members of the Harvard Republican Club planned on supporting Trump. Only 10% of their membership indicated that they support Trump. An overwhelming majority   80%   said that they will not support Trump. 10% of the club was still undecided at the time they were asked. You can read the full letter below.Dear Members and Alumni,In every presidential election since 1888, the members and Executive Board of the Harvard Republican Club have gathered to discuss, debate, and eventually endorse the standard-bearer of our party. But for the first time in 128 years, we, the oldest College Republicans chapter in the nation, will not be endorsing the Republican nominee.Donald Trump holds views that are antithetical to our values not only as Republicans, but as Americans. The rhetoric he espouses  from racist slander to misogynistic taunts  is not consistent with our conservative principles, and his repeated mocking of the disabled and belittling of the sacrifices made by prisoners of war, Gold Star families, and Purple Heart recipients is not only bad politics, but absurdly cruel.If enacted, Donald Trump s platform would endanger our security both at home and abroad. Domestically, his protectionist trade policies and draconian immigration restrictions would enlarge our federal deficit, raise prices for consumers, and throw our economy back into recession. Trump s global outlook, steeped in isolationism, is considerably out-of-step with the traditional Republican stance as well. The flippancy with which he is willing to abdicate the United States  responsibility to lead is alarming. Calling for the US  withdrawal from NATO and actively endorsing nuclear proliferation, Donald Trump s foreign policy would wreak havoc on the established world order which has held aggressive foreign powers in check since World War II.Perhaps most importantly, however, Donald Trump simply does not possess the temperament and character necessary to lead the United States through an increasingly perilous world. The last week should have made obvious to all what has been obvious to most for more than a year. In response to any slight  perceived or real  Donald Trump lashes out viciously and irresponsibly. In Trump s eyes, disagreement with his actions or his policies warrants incessant name calling and derision: stupid, lying, fat, ugly, weak, failing, idiot  and that s just his  fellow  Republicans.He isn t eschewing political correctness. He is eschewing basic human decency.Donald Trump, despite spending more than a year on the campaign trail, has either refused or been unable to educate himself on issues that matter most to Americans like us. He speaks only in platitudes, about greatness, success, and winning. Time and time again, Trump has demonstrated his complete lack of knowledge on critical matters, meandering from position to position over the course of the election. When confronted about these frequent reversals, Trump lies in a manner more brazen and shameless than anything politics has ever seen.Millions of people across the country are feeling despondent. Their hours have been cut, wages slashed, jobs even shipped overseas. But Donald Trump doesn t have a plan to fix that. He has a plan to exploit that.Donald Trump is a threat to the survival of the Republic. His authoritarian tendencies and flirtations with fascism are unparalleled in the history of our democracy. He hopes to divide us by race, by class, and by religion, instilling enough fear and anxiety to propel himself to the White House. He is looking to to pit neighbor against neighbor, friend against friend, American against American. We will not stand for this vitriolic rhetoric that is poisoning our country and our children.President Reagan called on us to maintain this, our shining city on a hill. He called on us to maintain freedom abroad by keeping a strong presence in the world. He called on us to maintain liberty at home by upholding the democratic process and respecting our opponents. He called on us to maintain decency in our hearts by loving our neighbor.He would be ashamed of Donald Trump. We are too.This fall, we will instead focus our efforts on reclaiming the Republican Party from those who have done it considerable harm, campaigning for candidates who will uphold the conservative principles that have defined the Republican Party for generations. We will work to ensure both chambers of Congress remain in Republican hands, continuing to protect against executive overreach regardless of who wins the election this November.We call on our party s elected leaders to renounce their support of Donald Trump, and urge our fellow College Republicans to join us in condemning and withholding their endorsement from this dangerous man. The conservative movement in America should not and will not go quietly into the night.A longtime student of American democracy, Alexis de Tocqueville once said,  America is great because she is good. If America ceases to be good, America will cease to be great. De Tocqueville believed in the United States. Americans are a decent people. We work hard, protect our own, and look out for one another in times of need, regardless of the color of our skin, the God we worship, or our party registration. Donald Trump may not believe in that America, but we do. And that America will never cease to be great.The Harvard Republican ClubGood going, Harvard Republicans. Now, hopefully the GOP leadership will follow suit.Featured image from Gage Skidmore/Flickr with text added",
        "label": 0
    },
    {
        "text": "(Reuters) - A group of state attorneys general are discussing whether to file their own court challenge against President Donald Trump’s order to restrict people from seven Muslim-majority countries entering the United States, officials in three states told Reuters. Democrat attorneys general are expected to be a source of fierce resistance to Trump, much as Republican AGs opposed former President Barack Obama. A lawsuit brought by states would heighten the legal stakes surrounding the president’s executive order, signed late on Friday, as courtroom challenges to the ban have so far mostly been filed by individuals. Officials in the offices of attorneys general in Pennsylvania, Washington and Hawaii said on Saturday they were evaluating what specific claims could be filed, and in which court. “We do believe the executive order is unconstitutional,” Hawaii attorney general Douglas Chin told Reuters on Saturday. He declined to give further detail. The states could decide not to file, and it is unclear how many states would ultimately sign on for such an effort. “There certainly are conversations underway,” said Joe Grace, a spokesman for Pennsylvania attorney general Josh Shapiro. A Trump representative could not be reached immediately for comment. Trump, a businessman who successfully tapped into American fears about terror attacks during his campaign, had promised what he called “extreme vetting” of immigrants and refugees from areas the White House said the U.S. Congress deemed to be high risk. He told reporters in the Oval Office on Saturday that his order was “not a Muslim ban” and said the measures were long overdue. However, his order hit a roadblock late on Saturday when a federal judge in New York said stranded travelers could stay in the country. The American Civil Liberties Union, which sought the emergency court order, said it would help 100 to 200 people with valid visas or refugee status who found themselves detained in transit or at U.S. airports after Trump signed the order. The Department of Homeland Security said in a statement it would comply with judicial orders but that Trump’s immigration restrictions remained in effect. ",
        "label": 1
    },
    {
        "text": "A group called  People s Action  just held their big gathering in Washington, DC yesterday. They had the usual suspects like Keith Ellison and Socialist Bernie Sanders speak at the meeting. They were protesting against cuts from the budget The bottom line is the radicals don t want any cuts to big government because they want to keep the cradle to grave freebies going. Socialist Bernie Sanders was ready to fill their minds with visions of freebies from big government.EARLIER TODAY, the group decided to hit Heritage Foundation headquarters by storming the offices with 200 thugs.HERE S WHAT THEY SAID:  We re shutting it down at @Heritage because it continues to be @realDonaldTrump s think tank. #RiseUp2017 #Budget4ThePeopleWe re shutting it down at @Heritage because it continues to be @realDonaldTrump s think tank. #RiseUp2017 #Budget4ThePeople pic.twitter.com/bnerOnBBa0  People s Action (@PplsAction) April 25, 2017Soros funded groups are all over DC with their push to keep Obama s agenda going. They got some help from Socialist Bernie Sanders who wants justice, justice, justice He s playing to his base in the video below:We must stand with @PplsAction and people all over this country in the fight for justice. Mr. Trump, you will not divide us up. pic.twitter.com/7kYBB7ZfvX  Bernie Sanders (@SenSanders) April 24, 2017PEOPLE S ACTION   SHEEPLE! ",
        "label": 0
    },
    {
        "text": "BRUSSELS (Reuters) - NATO has joined world powers  diplomatic efforts to stop North Korea s missile program but it cannot yet rely on its U.S.-built shield to defend Europe, experts and diplomats said. The United States says the shield, more than a decade in the planning, is needed to protect against so-called rogue states, a term U.S. officials have used to refer to North Korea and Iran.  But with Berlin, Paris and London potentially within striking distance of North Korea s missiles from next year, officials say the U.S.-led alliance s system needs more radars and special interceptors to destroy a rocket from Pyongyang.  The NATO shield in its current state lacks the reach and early warning radars to shoot down North Korean rockets. It s a weak link,  said Michael Elleman, a missile defense analyst at the International Institute for Strategic Studies (IISS).  Early tracking is also difficult because North Korean missiles would be flying over Russia, where NATO obviously cannot put radars,  he added. The sort of interceptor needed to shoot down North Korean ballistic missiles could breach a Soviet-era arms control agreement between the United States and Russia because of its greater range, arms experts say. Moscow has long objected to U.S. missile shield plans, saying their real aim is to neutralize Russia s own nuclear arsenal, rather than meet the perceived threat from  rogue states . Russia s strategic concerns would, therefore, make it hard to renegotiate the 1987 Intermediate Range Nuclear Forces (INF) treaty, something arms experts say would be required if a North Korean missile shield were to be fully effective.  Alliance planning to confront any threat from Pyongyang is in its infancy. Following North Korea s country s sixth and most powerful nuclear test on Sept. 3, two senior NATO diplomats told Reuters that protection against the North Korean threat was only beginning to be considered at NATO headquarters in Brussels. That was despite a more forceful diplomatic tone on the crisis and warnings on the scale and immediacy of the threat from U.S. President Donald Trump s new ambassador to NATO, France s defense minister and the alliance s deputy head. While analysts do not expect North Korea to have a reliable intercontinental ballistic missile until next year at the earliest, NATO s European allies could become a target as a way of threatening their closest partner, the United States, a third NATO diplomat said, stressing that was only speculation. The United States switched on its $800 million European missile defense umbrella in May last year at a site in Romania to protect against Iranian rockets.  The system, controlled from a NATO base in Germany, includes radars and interceptors stretching from eastern Europe to the Mediterranean.  A final site in Poland should be ready by late 2018, extending the European umbrella from Greenland and the Azores.    To shoot down a ballistic missile from North Korea would require a new generation of interceptor, the Block II, which is still in development. It is capable of downing ballistic rockets earlier and at a much higher altitude. However, Elleman said that U.S. missile sites in Alaska and California, as well as in Japan and South Korea, were likely to be given priority before Europe, when they are ready in 2018.  There will be a lot of competition for the assets,  he said. ",
        "label": 1
    },
    {
        "text": "OTTAWA (Reuters) - A planned meeting of foreign ministers to discuss the North Korean crisis is not scheduled to take place before the Christmas break in late December, a Canadian official said on Tuesday.  Foreign Minister Chrystia Freeland announced Canada would co-host the meeting with the United States on Canadian soil. At least a dozen foreign ministers will be involved, said the official, who asked to remain anonymous given the sensitivity of the situation. U.S Secretary of State Rex Tillerson, condemning a North Korean missile test earlier in the day, said the meeting would include South Korea, Japan and other affected nations, to discuss  how the global community can counter North Korea s threat to international peace.  Freeland had been discussing North Korea with counterparts in recent months, including those from the United States, South Korea, Japan, Australia and China, said the Canadian official. Canada was a good choice to host a meeting because it was less directly involved in the crisis than the United States, Japan, South Korea or China, said the official.  There are fewer implications to us convening a constructive conversation,  added the official, saying no decisions on a venue or who would be invited had been made. ",
        "label": 1
    },
    {
        "text": "PLEASE NOTE: No press allowed inside or anywhere near the meeting today with the Saudi Deputy Crown Prince: ",
        "label": 0
    },
    {
        "text": "Kid Rock has struck panic into the hearts of liberal politicians upon his announcement that he will be running for senate in Michigan.Kid Rock, whose real name is Robert James Ritchie, is from Romeo, Michigan and will be a force to be reckoned with in the upcoming election.U.S. Sen. Elizabeth Warren is already sounding the alarm with her Democratic base, warning a Senate run by Detroit bad boy Kid Rock could be the second coming of Donald Trump.Watch Fox News host, Tom Shillue tell panelists,  If Kid Rock runs for Senate, he ll win :The  Wasting Time  and  All Summer Long  rap rocker-turned-country singer tweeted on Wednesday that he s running for U.S. Senate in Michigan. Although it s been largely dismissed so far as a publicity stunt, Warren isn t taking any chances with the longshot Republican. I know a lot of people are thinking: this is some sort of joke, right?  Warren wrote in an email blast with the subject line  Senator Kid Rock (R-MI). Well,  she said,  maybe this is all a joke   but we all thought Donald Trump was joking when he rode down the escalator at Trump Tower and announced his campaign, too. And sure, maybe this is just a marketing gimmick for a new album or tour   but we all thought Donald Trump was just promoting his reality TV show, too,  she added.In her email, Warren included a link where people could donate to Michigan Democratic U.S. Sen. Debbie Stabenow and her own reelection campaign.A Warren campaign spokeswoman did not return repeated inquiries about how much the fundraising appeal has hauled in or the strategy behind it.But if the effort succeeds, other Democrats are likely to also cash in on a Rock candidacy   remote as it may be   to fill their own campaign coffers, said Larry Sabato, a political science professor at the University of Virginia. Political elites and activists who actually give money to campaigns keep up with all this stuff,  he said. Plus, the most effective direct mail is often tied to something that just happened   something that can be spun into a threat. Republican state Rep. Geoff Diehl, who will officially challenge Warren next month, blasted the email as proof that Warren is more concerned about crafting a bid for the White House. She uses any and every issue, whether it s a celebrity Republican or it s Hillary Clinton, to try to scare her support base into giving her more money so that she can reach that main goal I believe of running for president   not of focusing on the concerns of her constituents in Massachusetts,  said Diehl.Still, don t count him out, said Saul Anuzis, the former chairman of the Michigan Republican Party. He s well-liked,  said Anuzis.  He s a big proponent of Detroit and somebody who s put his money where his mouth is investing back home.   Boston HeraldKid Rock is taking a page from the Donald Trump playbook. He s already responding to #FakeNews on his website.",
        "label": 0
    },
    {
        "text": "WASHINGTON (Reuters) - Democrats said on Wednesday their U.S. Senate victory in Alabama could lead to a sweeping comeback for the party in 2018 elections, while Republicans sought to assess blame for a defeat in one of the country’s most conservative states. Doug Jones, a Democrat and former federal prosecutor, won the special election on Tuesday night after a bitter campaign that drew national attention amid sexual misconduct accusations against conservative Republican candidate Roy Moore. President Donald Trump had endorsed Moore and the loss was a stunning upset for him and fellow Republicans, narrowing their majority in the Senate to 51-49. It also boosted Democrats who hope to retake control of Congress in elections next November. Trump, speaking to reporters at the White House, said the Alabama outcome would not affect his policy agenda. Republicans are rushing to pass a tax overhaul package by the end of the year. Jones is expected to take office in early January after the election results are certified. “Wish we would have gotten the seat,” Trump said. “A lot of Republicans feel differently. They’re very happy with the way it turned out.” At a news conference in Birmingham, Alabama, on Wednesday, Jones said he received congratulatory calls from Trump, as well as Senate Majority Leader Mitch McConnell, a Republican, and Senator Chuck Schumer, the Democratic leader.  Some congressional Republicans were quick on Wednesday to slam former Trump strategist Steve Bannon for his steadfast support of Moore, saying it split the party and paved the way for Jones’ shocking victory. Jones, 63, was the first Democrat elected to the Senate from Alabama in a quarter-century and the party sees potential nationwide. “This campaign has given a lot of people a reason to believe,” Jones said.  Schumer said the defeat of Moore reflected a distaste among voters for Trump’s policies, which he said help the wealthy and powerful to the detriment of the middle class. “Things are looking good for us,” Schumer told reporters. “If they (Republicans) continue to run the government for the benefit of the few special powerful wealthy interests, there will be many more Alabamas in 2018.” Some Senate Republicans expressed relief that Moore would not be joining their ranks, including Bob Corker, a frequent Trump critic who is retiring next year.   “I know we’re supposed to cheer for our side of the aisle ... but I’m really, really happy with what happened for all of us in our nation, for people serving in the Senate, to not have to deal with what we were likely going to have to deal with should the outcome have been the other way,” Corker said.  Bannon, Trump’s former chief White House strategist, worked hard for Moore as part of his broader campaign against more centrist Republican leaders, and his critics were quick to attack on Wednesday. “This guy does not belong on the national stage,”  Republican Representative Peter King said on CNN. “He’s not representing what I stand for. I consider myself a conservative Republican. ... And he sort of parades himself out there with his weird, alt-right views that he has. And, to me, it’s demeaning the whole governmental and political process.” Moore, a hard-line conservative who was twice removed from his seat on the Alabama Supreme Court for refusing to abide by federal law, became the Republican candidate by beating incumbent Senator Luther Strange in a primary race earlier this year. Strange had been appointed to fill the seat vacated by Republican Jeff Sessions when he became Trump’s attorney general. McConnell and other Republican leaders in Congress backed Strange in that race and then pressured Moore to withdraw his candidacy after he faced allegations from several women that he sexually assaulted or pursued them when they were teenagers and he was in his 30s Moore, 70, denied the accusations. McConnell, who has been a frequent Bannon target, declined to address Bannon’s role in the race when speaking to reporters on Wednesday. “It was quite an impressive election,” McConnell said. “It was a big turnout and an unusual day.”  Strange had harsh words for Bannon.  “He has accomplished one thing that I don’t think anybody in America thought was possible, and that’s getting a Democrat elected in the state of Alabama,” Strange said on Fox News Channel. Trump backed Strange in the Republican primary but then endorsed Moore and threw his full support behind him even as other party leaders in Washington walked away. Trump tried to minimize the damage to his own credibility on Wednesday. “The reason I originally endorsed Luther Strange (and his numbers went up mightily), is that I said Roy Moore will not be able to win the General Election. I was right!” he said on Twitter. “Roy worked hard but the deck was stacked against him!” Some Republicans defended Trump. “It had zero to do with Donald Trump,” Republican Representative Bradley Byrne of Alabama told MSNBC, calling the race “a purely weird, unique election.” As of Wednesday night, Moore had not conceded the race to Jones, saying in a video statement that there are military and provisional ballots still to be counted and that the campaign was waiting for certification by the Secretary of State.    “We are indeed in a struggle to preserve our republic, our civilization, and our religion and to set free a suffering humanity,” he said. “And the battle rages on.”   Jones’ victory was not expected to affect pending votes in Congress on funding the government or the Republican overhaul of the tax code. Republican congressional leaders have vowed to get the tax changes approved before Christmas. The Alabama outcome could push Democrats to make sexual harassment a key election issue at a time when many powerful men in entertainment, the media and politics - including Trump - have faced accusations of misconduct. Such a move could help boost support from women.  The results also highlighted Jones’ success in mobilizing  African-Americans voters, who constituted about 30 percent of those voting on Tuesday and overwhelmingly voted Democratic, according to network exit polls.  Jones also fared surprisingly well in suburban counties outside of cities such as Birmingham and Huntsville, a trend that has Republicans nervous ahead of next year’s elections, when dozens of congressional districts are likely to be highly competitive. Part of the reason for that in Alabama was that many upscale Republican voters did not vote as compared with last year’s presidential election.  ",
        "label": 1
    },
    {
        "text": "Hello Megyn Kelly! Time for a little karma! Word on the street is that Megyn Kelly will not be  welcomed back  at FOX News even if she comes crawling back from NBC.She s had a rocky start at NBC with her Putin interview and now with the much-hyped Alex Jones interview. You d think the controversy surrounding her contentious interview with Jones would pump up the ratings but it didn t. Perhaps it s because she s become so unlikeable on camera with her snarky questioning and cold as ice demeanor.Even if she comes calling at FOX, it s a no go according to Breitbart news: After Kelly s controversial and much-hyped interview with Alex Jones tanked by again failing to beat out reruns of 60 Minutes and America s Funniest Home Videos, New York radio host Mark Simone tweeted on Monday that NBC is trying to unload Kelly and convince Fox News to take her back.But a high-ranking Fox News source told Breitbart News that there is  no way  Kelly could come back to the network. Quite simply, the source told Breitbart News, Kelly  would not be welcomed back.  Simone also suggested that if Kelly becomes more toxic and her ratings tank even more,  NBC will have to take her off the network,  and  if they are stuck with her, they ll give her an MSNBC show.  Before she bolted to NBC, Kelly anchored The Kelly File on Fox News. During the 2016 election cycle, Kelly won praise from mainstream media journalists when she tried to undercut Donald Trump during the first Republican presidential debate in August of 2015 in Cleveland, Ohio. She also gave  Never Trumpers  a forum on her primetime show to constantly slam Trump throughout the election cycle.And as the Daily Beast s Lloyd Grove noted, Kelly also  hastened Roger Ailes  forced resignation last July with her fateful decision to recount his misconduct to a team of lawyers hired by 21st Century Fox to investigate allegations made in the sexual harassment and retaliation lawsuit filed by Fox News anchor Gretchen Carlson.  New York magazine s Gabriel Sherman reported that Kelly  told investigators that Ailes made unwanted sexual advances toward her about ten years ago when she was a young correspondent at Fox. As Grove pointed out, Kelly, in her book, said there was some  poetic justice  in the role she played in helping boot Ailes out of Fox News. I worked my tail off  I established myself as a serious person,  Kelly wrote.  I built my own power. And when the allegations against Roger hit, I used it. Perhaps there is some poetic justice in that. NBC reportedly invested nearly $20 million a year to bring Kelly to the network, and NBC s investment has not paid any dividends at all. After her interview with Russian President Vladimir Putin, Kelly was mocked for being way out of her league. And when HuffPost obtained the full unedited interview in which a  nervous  Kelly lobbed Putin  softballs,  Kelly was subjected to another round of criticism.Her interview with Jones did not have any news value and may have damaged NBC s and her reputation more than it helped.You know what they say about KARMA it s a B*tch!Read more: Breitbart News",
        "label": 0
    },
    {
        "text": "In March 2015, only months after Detroit emerged from largest municipal bankruptcy filing in American history, the Democrat Detroit City Clerk Janice Winfrey, who was making over $73,000 per year, and had access to take-home city-owned car boldly asked the city to give her a raise. Winfrey argued that,  I oversee a budget of $13 million and approximately 200 full- and part-time employees.  She told WWJ s Charlie Langton that the  timing might be terrible  but she feels justified. She claimed people should consider all of her responsibilities.On March 30, 2015 a compensation panel on Monday agreed that the  overworked  Janice Winfrey s pay should be increased to $78,761 per year.But how hard did Janice Winfrey really work and did she really deserve a raise?Michigan s largest county voted overwhelmingly for Democratic candidate Hillary Clinton, but officials couldn t reconcile vote totals for 610 of 1,680 precincts during a countywide canvass of vote results late last month.Most of those are in heavily Democratic Detroit, where the number of ballots in precinct poll books did not match those of voting machine printout reports in 59 percent of precincts, 392 of 662.DETROIT ELECTIONS ARE A TOTAL MESS!  Janice Winfrey should have called a news conference last January and said Detroit could not run its 2016 elections effectively without people stepping up to replace aging, incapable poll workers.Had she done that, the Detroit city clerk, who was widely praised for transforming the department when she ousted former Clerk Jackie Currie in 2005, would not be facing a firestorm of criticism over mishandled voter ballots and malfunctioning machines.She also wouldn t have had some precincts where capable veterans worked alongside some people who could not read, weren t properly trained, weren t mobile and didn t know how to use new electronic polling books that long ago replaced paper sheets, one veteran polling supervisor who has worked the polls for 30 years asserted Thursday. The one thing I noticed   and this is where the problem is cropping up   is that a lot of folks have mobility issues and other issues,  said Christopher Flournoy, 52, a residential home improvement salesperson who lives in Russell Woods.Flournoy has been working the polls since he was in his 20s, and said things are not as they should be. I have personally been shocked when I go to training,  he said.  They do provide training and you ll see people come in on walkers and with crutches, and the one thought I had is how on earth are they going to carry on their responsibilities as an elections inspector? The biggest problem is training   and I don t like to say disparaging things   but the trainers are not trained to provide instruction. They re winging it. They don t have people who have been trained to provide training to adults. It becomes a gripe session about the previous election. You get handed some materials and nobody says good luck, but that s implied. You ll figure out as you go along. The average age of poll workers nationwide is 68. Detroit workers are older, Winfrey said earlier this week. And the work is grueling   15-18 hours with only two one-hour meal times and two other 15-minute breaks. We re getting older folks doing it because they ve always done it like me, and we re getting another group doing it because it s an easy way to make a $150,  Flournoy said. I ve had workers in precincts I supervise who couldn t read. They absolutely could not read and couldn t operate the computer,  he said, adding that Winfrey should return to giving the aptitude test she created when she was first elected.  That s where it goes back to   training. Training is supposed to be mandatory, but I ve had people to show up and say  No, I didn t do training, but they gave me a credential.    Read more: DFP ",
        "label": 0
    }
]